# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Ultralightweight JSON parser in ANSI C
brew "cjson"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Easy TOC creation for GitHub README.md (in go)
brew "github-markdown-toc"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Fast, async, resource-friendly link checker
brew "lychee"
# Fast, flexible, config-based cli for linting Markdown/CommonMark files
brew "markdownlint-cli2"
# Install NodeJS versions
brew "node-build"
# Node.js version manager
brew "nodenv"
# Libraries for security-enabled client and server applications
brew "nss"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Swiss-army knife of markup format conversion
brew "pandoc"
# General-purpose scripting language
brew "php", restart_service: :changed
# Tool to interact with the Phrase API
brew "phrase-cli"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast, disk space efficient package manager
brew "pnpm"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Python version management
brew "pyenv"
# Rust toolchain installer
brew "rustup"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Syntax-aware linter for prose
brew "vale"
# Application launcher and productivity software
cask "alfred"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# OpenAI's official browser with ChatGPT built in
cask "chatgpt-atlas"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-hackgen"
cask "font-opendyslexic-nerd-font"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Grammarly for desktop
cask "grammarly-desktop"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar manager
cask "jordanbaird-ice"
# Keyboard customiser
cask "karabiner-elements"
# Open-source keystroke visualiser
cask "keycastr"
# Discover, download, and run local LLMs
cask "lm-studio"
# Software for Logitech devices
cask "logi-options+"
# Open-source Markdown editor
cask "macdown"
# Track and update to the latest versions of installed software
cask "macupdater"
# App to write, plan, collaborate, and get organised
cask "notion"
# Security checklist app
cask "pareto-security"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Emoji picker optimised for blind people
cask "rocket"
# Collection of apps available by subscription
cask "setapp"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Native GUI for Homebrew package management
cask "taphouse"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
vscode "aaron-bond.better-comments"
vscode "alanwalk.markdown-navigation"
vscode "alefragnani.rtf"
vscode "andersliu.insert-line-number"
vscode "antfu.slidev"
vscode "anthropic.claude-code"
vscode "be5invis.toml"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bodil.prettier-toml"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "burkeholland.simple-react-snippets"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codedungeon.open-in-macdown"
vscode "csvlinter.csvlinter-vscode"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dnicolson.binary-plist"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-open-in-finder"
vscode "fasani.coding-in-the-sun"
vscode "figma.figma-vscode-extension"
vscode "fmoronzirfas.open-in-marked"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "ginfuru.ginfuru-better-solarized-dark-theme"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.arb-editor"
vscode "grapecity.gc-excelviewer"
vscode "humao.rest-client"
vscode "ics.japanese-proofreading"
vscode "idleberg.applescript"
vscode "idleberg.jxa"
vscode "jackytsu.text-transformer"
vscode "janisdd.vscode-edit-csv"
vscode "jannisx11.batch-rename-extension"
vscode "jebbs.plantuml"
vscode "jerriepelser.copy-markdown-as-html"
vscode "jianbingfang.dupchecker"
vscode "jinhyuk.replace-curly-quotes"
vscode "jock.svg"
vscode "jtr.vscode-position"
vscode "kirozen.wordcounter"
vscode "manuth.markdown-converter"
vscode "mechatroner.rainbow-csv"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "mhcpnl.xcodestrings"
vscode "mosapride.zenkaku"
vscode "mousetraps.selected-character-count"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.vscode-chat-customizations-evaluations"
vscode "ms-vscode.vscode-websearchforcopilot"
vscode "ms-vscode.wordcount"
vscode "mushan.vscode-paste-image"
vscode "openai.chatgpt"
vscode "phplasma.csv-to-table"
vscode "pkief.material-icon-theme"
vscode "pwabuilder.pwa-studio"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rogalmic.zsh-debug"
vscode "sandcastle.vscode-open"
vscode "satokaz.vscode-bs-ctrlchar-remover"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sifue.japanese-word-count"
vscode "sleistner.vscode-fileutils"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "telesoho.vscode-markdown-paste-image"
vscode "thinker.sort-json"
vscode "tomoki1207.pdf"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.remove-empty-lines"
vscode "viablelab.capitalize"
vscode "vincaslt.highlight-matching-tag"
vscode "vstirbu.vscode-mermaid-preview"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "wengerk.highlight-bad-chars"
vscode "wmaurer.change-case"
vscode "wraith13.open-in-github-desktop"
vscode "yogipatel.solarized-light-no-bold"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
go "golang.org/x/tools/gopls"
